noahzwiep/Capstone/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t ENCODER2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA1 (pin 35)  */
    GPIO_PinInit(BOARD_ENCODER2_GPIO, BOARD_ENCODER2_PIN, &ENCODER2_config);

    gpio_pin_config_t RIGHT_MOTOR_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA2 (pin 36)  */
    GPIO_PinInit(BOARD_RIGHT_MOTOR_B_GPIO, BOARD_RIGHT_MOTOR_B_PIN, &RIGHT_MOTOR_B_config);

    gpio_pin_config_t ENCODER1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB9 (pin 57)  */
    GPIO_PinInit(BOARD_ENCODER1_GPIO, BOARD_ENCODER1_PIN, &ENCODER1_config);

    gpio_pin_config_t MPU6050_INTERRUPT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB11 (pin 59)  */
    GPIO_PinInit(BOARD_MPU6050_INTERRUPT_GPIO, BOARD_MPU6050_INTERRUPT_PIN, &MPU6050_INTERRUPT_config);

    gpio_pin_config_t RIGHT_MOTOR_A_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB23 (pin 69)  */
    GPIO_PinInit(BOARD_RIGHT_MOTOR_A_GPIO, BOARD_RIGHT_MOTOR_A_PIN, &RIGHT_MOTOR_A_config);

    gpio_pin_config_t MANUAL_MODE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 70)  */
    GPIO_PinInit(BOARD_MANUAL_MODE_GPIO, BOARD_MANUAL_MODE_PIN, &MANUAL_MODE_config);

    gpio_pin_config_t FRONT_RIGHT_ACT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 71)  */
    GPIO_PinInit(BOARD_FRONT_RIGHT_ACT_GPIO, BOARD_FRONT_RIGHT_ACT_PIN, &FRONT_RIGHT_ACT_config);

    gpio_pin_config_t MOTOR_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 72)  */
    GPIO_PinInit(BOARD_MOTOR_EN_GPIO, BOARD_MOTOR_EN_PIN, &MOTOR_EN_config);

    gpio_pin_config_t LEFT_MOTOR_A_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 73)  */
    GPIO_PinInit(BOARD_LEFT_MOTOR_A_GPIO, BOARD_LEFT_MOTOR_A_PIN, &LEFT_MOTOR_A_config);

    gpio_pin_config_t FRONT_LEFT_LIMIT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 77)  */
    GPIO_PinInit(BOARD_FRONT_LEFT_LIMIT_GPIO, BOARD_FRONT_LEFT_LIMIT_PIN, &FRONT_LEFT_LIMIT_config);

    gpio_pin_config_t FRONT_RIGHT_LIMIT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 79)  */
    GPIO_PinInit(BOARD_FRONT_RIGHT_LIMIT_GPIO, BOARD_FRONT_RIGHT_LIMIT_PIN, &FRONT_RIGHT_LIMIT_config);

    gpio_pin_config_t FRONT_LEFT_ACT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC8 (pin 80)  */
    GPIO_PinInit(BOARD_FRONT_LEFT_ACT_GPIO, BOARD_FRONT_LEFT_ACT_PIN, &FRONT_LEFT_ACT_config);

    gpio_pin_config_t AUTO_MODE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC9 (pin 81)  */
    GPIO_PinInit(BOARD_AUTO_MODE_GPIO, BOARD_AUTO_MODE_PIN, &AUTO_MODE_config);

    gpio_pin_config_t RIGHT_ENCODER_1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC10 (pin 82)  */
    GPIO_PinInit(BOARD_RIGHT_ENCODER_1_GPIO, BOARD_RIGHT_ENCODER_1_PIN, &RIGHT_ENCODER_1_config);

    gpio_pin_config_t RIGHT_ENCODER_2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC11 (pin 83)  */
    GPIO_PinInit(BOARD_RIGHT_ENCODER_2_GPIO, BOARD_RIGHT_ENCODER_2_PIN, &RIGHT_ENCODER_2_config);

    gpio_pin_config_t LEFT_MOTOR_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC12 (pin 84)  */
    GPIO_PinInit(BOARD_LEFT_MOTOR_B_GPIO, BOARD_LEFT_MOTOR_B_PIN, &LEFT_MOTOR_B_config);

    gpio_pin_config_t FRONT_RIGHT_RPM_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD1 (pin 94)  */
    GPIO_PinInit(BOARD_FRONT_RIGHT_RPM_GPIO, BOARD_FRONT_RIGHT_RPM_PIN, &FRONT_RIGHT_RPM_config);

    gpio_pin_config_t REAR_RPM_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin 95)  */
    GPIO_PinInit(BOARD_REAR_RPM_GPIO, BOARD_REAR_RPM_PIN, &REAR_RPM_config);

    gpio_pin_config_t FRONT_LEFT_RPM_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD3 (pin 96)  */
    GPIO_PinInit(BOARD_FRONT_LEFT_RPM_GPIO, BOARD_FRONT_LEFT_RPM_PIN, &FRONT_LEFT_RPM_config);

