noahzwiep/Capstone/board/pin_mux.c
    gpio_pin_config_t LED_ERROR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE26 (pin 33)  */
    GPIO_PinInit(BOARD_LED_ERROR_GPIO, BOARD_LED_ERROR_PIN, &LED_ERROR_config);

    /* PORTA1 (pin 35) is configured as PTA1 */
    PORT_SetPinMux(BOARD_ENCODER2_PORT, BOARD_ENCODER2_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA1 (pin 35): Interrupt/DMA request is disabled */
    PORT_SetPinInterruptConfig(BOARD_ENCODER2_PORT, BOARD_ENCODER2_PIN, kPORT_InterruptOrDMADisabled);

    PORTA->PCR[1] = ((PORTA->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Drive Strength Enable: Low drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_LowDriveStrength)

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

    /* PORTA2 (pin 36) is configured as PTA2 */
    PORT_SetPinMux(BOARD_RIGHT_MOTOR_B_PORT, BOARD_RIGHT_MOTOR_B_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[2] = ((PORTA->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTB11 (pin 59) is configured as PTB11 */
    PORT_SetPinMux(BOARD_MPU6050_INTERRUPT_PORT, BOARD_MPU6050_INTERRUPT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB11 (pin 59): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_MPU6050_INTERRUPT_PORT, BOARD_MPU6050_INTERRUPT_PIN, kPORT_InterruptRisingEdge);

    PORTB->PCR[11] = ((PORTB->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                      | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTB2 (pin 55) is configured as ADC0_SE12 */
    PORT_SetPinMux(BOARD_ADC0_SE12_PORT, BOARD_ADC0_SE12_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB23 (pin 69) is configured as PTB23 */
    PORT_SetPinMux(BOARD_RIGHT_MOTOR_A_PORT, BOARD_RIGHT_MOTOR_A_PIN, kPORT_MuxAsGpio);

    /* PORTB9 (pin 57) is configured as PTB9 */
    PORT_SetPinMux(BOARD_ENCODER1_PORT, BOARD_ENCODER1_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB9 (pin 57): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_ENCODER1_PORT, BOARD_ENCODER1_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[9] = ((PORTB->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTC0 (pin 70) is configured as PTC0 */
    PORT_SetPinMux(BOARD_MANUAL_MODE_PORT, BOARD_MANUAL_MODE_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC0 (pin 70): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_MANUAL_MODE_PORT, BOARD_MANUAL_MODE_PIN, kPORT_InterruptFallingEdge);

    PORTC->PCR[0] = ((PORTC->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input.
                      * Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTC1 (pin 71) is configured as PTC1 */
    PORT_SetPinMux(BOARD_FRONT_RIGHT_ACT_PORT, BOARD_FRONT_RIGHT_ACT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC1 (pin 71): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_FRONT_RIGHT_ACT_PORT, BOARD_FRONT_RIGHT_ACT_PIN, kPORT_InterruptFallingEdge);

    PORTC->PCR[1] = ((PORTC->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTC10 (pin 82) is configured as PTC10 */
    PORT_SetPinMux(BOARD_RIGHT_ENCODER_1_PORT, BOARD_RIGHT_ENCODER_1_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC10 (pin 82): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_RIGHT_ENCODER_1_PORT, BOARD_RIGHT_ENCODER_1_PIN, kPORT_InterruptFallingEdge);

    PORTC->PCR[10] = ((PORTC->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTC11 (pin 83) is configured as PTC11 */
    PORT_SetPinMux(BOARD_RIGHT_ENCODER_2_PORT, BOARD_RIGHT_ENCODER_2_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC11 (pin 83): Interrupt/DMA request is disabled */
    PORT_SetPinInterruptConfig(BOARD_RIGHT_ENCODER_2_PORT, BOARD_RIGHT_ENCODER_2_PIN, kPORT_InterruptOrDMADisabled);

    PORTC->PCR[11] = ((PORTC->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTC12 (pin 84) is configured as PTC12 */
    PORT_SetPinMux(BOARD_LEFT_MOTOR_B_PORT, BOARD_LEFT_MOTOR_B_PIN, kPORT_MuxAsGpio);

