noahzwiep/Capstone/board/pin_mux.c
    /* PORTC16 (pin 90) is configured as UART3_RX */
    PORT_SetPinMux(BOARD_GPS_RX_PORT, BOARD_GPS_RX_PIN, kPORT_MuxAlt3);

    /* PORTC17 (pin 91) is configured as UART3_TX */
    PORT_SetPinMux(BOARD_GPS_TX_PORT, BOARD_GPS_TX_PIN, kPORT_MuxAlt3);

    /* PORTC2 (pin 72) is configured as PTC2 */
    PORT_SetPinMux(BOARD_MOTOR_EN_PORT, BOARD_MOTOR_EN_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 73) is configured as PTC3 */
    PORT_SetPinMux(BOARD_LEFT_MOTOR_A_PORT, BOARD_LEFT_MOTOR_A_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 76) is configured as FTM0_CH3 */
    PORT_SetPinMux(BOARD_RIGHT_MOTOR_PWM_PORT, BOARD_RIGHT_MOTOR_PWM_PIN, kPORT_MuxAlt4);

    /* PORTC5 (pin 77) is configured as PTC5 */
    PORT_SetPinMux(BOARD_FRONT_LEFT_LIMIT_PORT, BOARD_FRONT_LEFT_LIMIT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC5 (pin 77): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_FRONT_LEFT_LIMIT_PORT, BOARD_FRONT_LEFT_LIMIT_PIN, kPORT_InterruptFallingEdge);

    PORTC->PCR[5] =
        ((PORTC->PCR[5] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

         /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the corresponding PE
          * field is set. */
         | PORT_PCR_PS(kPORT_PullUp)

         /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
         | PORT_PCR_PE(kPORT_PullDisable)

         /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is configured as
          * a digital output. */
         | PORT_PCR_SRE(kPORT_FastSlewRate)

         /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the pin is
          * configured as a digital input.
          * Refer to the device data sheet for filter characteristics. */
         | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTC7 (pin 79) is configured as PTC7 */
    PORT_SetPinMux(BOARD_FRONT_RIGHT_LIMIT_PORT, BOARD_FRONT_RIGHT_LIMIT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC7 (pin 79): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_FRONT_RIGHT_LIMIT_PORT, BOARD_FRONT_RIGHT_LIMIT_PIN, kPORT_InterruptFallingEdge);

    PORTC->PCR[7] =
        ((PORTC->PCR[7] &
          /* Mask bits to zero which are setting */
          (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

         /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the corresponding PE
          * field is set. */
         | PORT_PCR_PS(kPORT_PullUp)

         /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
         | PORT_PCR_PE(kPORT_PullDisable)

         /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is configured as
          * a digital output. */
         | PORT_PCR_SRE(kPORT_FastSlewRate)

         /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the pin is
          * configured as a digital input.
          * Refer to the device data sheet for filter characteristics. */
         | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTC8 (pin 80) is configured as PTC8 */
    PORT_SetPinMux(BOARD_FRONT_LEFT_ACT_PORT, BOARD_FRONT_LEFT_ACT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC8 (pin 80): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_FRONT_LEFT_ACT_PORT, BOARD_FRONT_LEFT_ACT_PIN, kPORT_InterruptFallingEdge);

    PORTC->PCR[8] = ((PORTC->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTC9 (pin 81) is configured as PTC9 */
    PORT_SetPinMux(BOARD_AUTO_MODE_PORT, BOARD_AUTO_MODE_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC9 (pin 81): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_AUTO_MODE_PORT, BOARD_AUTO_MODE_PIN, kPORT_InterruptFallingEdge);

    PORTC->PCR[9] = ((PORTC->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input.
                      * Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTD0 (pin 93) is configured as FTM3_CH0 */
    PORT_SetPinMux(BOARD_LEFT_MOTOR_FTM_PORT, BOARD_LEFT_MOTOR_FTM_PIN, kPORT_MuxAlt4);

    /* PORTD1 (pin 94) is configured as PTD1 */
    PORT_SetPinMux(BOARD_FRONT_RIGHT_RPM_PORT, BOARD_FRONT_RIGHT_RPM_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD1 (pin 94): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_FRONT_RIGHT_RPM_PORT, BOARD_FRONT_RIGHT_RPM_PIN, kPORT_InterruptFallingEdge);

    PORTD->PCR[1] = ((PORTD->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTD2 (pin 95) is configured as PTD2 */
    PORT_SetPinMux(BOARD_REAR_RPM_PORT, BOARD_REAR_RPM_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD2 (pin 95): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_REAR_RPM_PORT, BOARD_REAR_RPM_PIN, kPORT_InterruptFallingEdge);

